Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This pattern facilitates concurrent operations because it does not need to block while waiting for the Observable to emit objects, but instead it creates a sentry in the form of an observer that stands ready to react appropriately at whatever future time the Observable does so.
zh_cn: 这种模式有利于并发操作，因为它不需要在等待 Observable 发射对象时阻塞，而是以观察者的形式创建一个哨兵，随时准备在 Observable 发射对象做出适当的反应。

source: This principle should be followed regardless of whether the feature is believed to cause a security problem.
zh_cn: 无论该功能是否被认为会导致安全问题，都应遵循此原则。

source: This procedure normally is initiated by one TCP and responded to by another TCP.
zh_cn: 此过程通常由一个 TCP 启动，并由另一个 TCP 响应。

source: This process consists of three steps: (1) verify that Q is not the point at infinity (O), (2) verify that for Q = (x, y) both integers x and y are in the correct interval, and (3) ensure that (x, y) is a correct solution to the elliptic curve equation.
zh_cn: 该过程包括三个步骤：（1）验证 Q 不是无穷远处的点(O)，（2）验证对于 Q = (x, y)，整数 x 和 y 都在正确的区间内，并且（3） 确保 (x, y) 是椭圆曲线方程的正确解。

source: This produces a full key derivation schedule shown in the diagram below.
zh_cn: 这将生成一个完整的密钥推导计划，如下图所示。

source: This produces two values, r and s.
zh_cn: 这会产生两个值 r 和 s。

source: This protocol includes more stringent requirements than HTTP/1.0 in order to ensure reliable implementation of its features.
zh_cn: 该协议包含比 HTTP/1.0 更严格的要求，以确保其功能的可靠实现。

source: This protocol is used to negotiate the secure attributes of a session.
zh_cn: 该协议用于协商会话的安全属性。

source: This provides an opportunity for senders to pad any TLS record by a chosen amount as long as the total stays within record size limits.
zh_cn: 只要总数保持在记录大小限制范围内，这就为发送者提供了按选定数量填充任何 TLS 记录的机会。

source: This pseudo header contains the Source Address, the Destination Address, the Protocol, and TCP length.
zh_cn: 此伪首部包含源地址，目标地址，协议和 TCP 长度。

source: This pseudorandom function (PRF) takes as input a secret, a seed, and an identifying label and produces an output of arbitrary length.
zh_cn: 该伪随机函数 (pseudorandom function) (PRF)将机密，种子和标识标签作为输入，并产生任意长度的输出。

source: This random value is generated by the client and is used to generate the master secret, as specified in Section 8.1.
zh_cn: 该随机值由客户端生成，用于生成主密钥，如第 8.1 节中所述。

source: This reconstruction involves both the server's local configuration and information communicated in the request-target, Host header field, and connection context.
zh_cn: 此重建涉及服务器的本地配置和在请求目标，主机首部字段和连接上下文中传递的信息。

source: This requirement overrides the general rule for forwarding of 1xx responses (see section 10.1).
zh_cn: 此要求会覆盖转发 1xx 响应的一般规则(请参阅第 10.1 节)。

source: This requirement prevents an interoperability failure when the message is being received by an HTTP/1.1 (or later) proxy and forwarded to an HTTP/1.0 recipient.
zh_cn: 当 HTTP/1.1(或更高版本)代理接收邮件并转发给 HTTP/1.0 收件人时，此要求可防止互操作性失败。

source: This scenario leads to the example shown in figure 10.
zh_cn: 该场景导致图 10 中所示的示例。

source: This secret MUST be quite long; currently defined key exchange methods exchange secrets that range from 46 bytes upwards.
zh_cn: 这个机密必须很长；当前定义的密钥交换方法交换 46 字节以上的机密。

source: This section defines the process of resolving a URI reference within a context that allows relative references so that the result is a string matching the <URI> syntax rule of Section 3.
zh_cn: 本节定义了在允许相对引用的上下文中解析 URI 引用的过程，以便结果是与第 3 节的 <URI> 语法规则匹配的字符串。

source: This section defines the scheme-specific syntax and semantics for http URLs.
zh_cn: 本节定义了 http URL 的特定于方案的语法和语义。

source: This section provides TLS-specific requirements.
zh_cn: 本节提供特定于 TLS 的要求。

source: This should be backwards compatible but does behave differently.
zh_cn: 这应该是向后兼容的，但表现不同。

source: This signaling takes place using the Connection header field (section 14.10).
zh_cn: 此信号使用 Connection 首部字段进行(第 14.10 节)。

source: This space ranges from 0 to 2**32 - 1.
zh_cn: 此空间范围为 0 到 2**32 - 1.

source: This specification adopts the definitions of "URI-reference", "absoluteURI", "relativeURI", "port", "host","abs_path", "rel_path", and "authority" from that specification.
zh_cn: 该规范采用了那个规范中的 "URI-reference", "absoluteURI", "relativeURI", "port", "host","abs_path", "rel_path", 和 "authority" 的定义。

source: This specification also updates the use of CONNECT to establish a tunnel, previously defined in RFC 2817, and defines the "https" URI scheme that was described informally in RFC 2818.
zh_cn: 此规范还更新了使用 CONNECT 建立隧道(先前在 RFC 2817 中定义)，并定义了 RFC 2818 中非正式描述的“https”URI 方案。

source: This specification defines a number of standardized methods that are commonly used in HTTP, as outlined by the following table.
zh_cn: 此规范定义了 HTTP 中常用的许多标准化方法，如下表所示。

source: This specification defines the generic URI syntax and a process for resolving URI references that might be in relative form, along with guidelines and security considerations for the use of URIs on the Internet.
zh_cn: 此规范定义了通用 URI 语法和用于解析可能相对形式的 URI 引用的过程，以及在互联网上使用 URI 的准则和安全注意事项。

source: This specification defines the protocol referred to as "HTTP/1.1", and is an update to RFC 2068 [33].
zh_cn: 该规范定义了称为“HTTP/1.1”的协议，并且是对 RFC 2068 [33] 的更新。

source: This specification defines the protocol referred to as "HTTP/1.1".
zh_cn: 该规范定义了称为“HTTP/1.1”的协议。

source: This specification defines those elements of the URI syntax that are required of all URI schemes or are common to many URI schemes.
zh_cn: 此规范定义了所有 URI 方案所需的 URI 语法元素，或者是许多 URI 方案所共有的元素。

source: This specification defines version "1.1".
zh_cn: 该规范定义了版本“1.1”。

source: This specification deprecates such line folding except within the message/http media type (Section 8.3.1).
zh_cn: 除了在 message/http 媒体类型(第 8.3.1 节)中之外，此规范不推荐使用此类折叠。

source: This specification does not define a generative grammar for URIs; that task is performed by the individual specifications of each URI scheme.
zh_cn: 该规范没有定义 URI 的生成语法；该任务由每个 URI 方案的各个规范执行。

source: This specification does not limit the scope of what might be a resource; rather, the term "resource" is used in a general sense for whatever might be identified by a URI.
zh_cn: 该规范不限制可能是资源的范围；相反，术语“资源”在一般意义上用于可能由 URI 识别的任何内容。

source: This specification does not mandate a particular registered name lookup technology and therefore does not restrict the syntax of reg-name beyond what is necessary for interoperability.
zh_cn: 本规范不要求特定的注册名称查找技术，因此不会限制注册名称的语法超出互操作性所需的语法。

source: This specification does not mandate any particular character encoding for mapping between URI characters and the octets used to store or transmit those characters.
zh_cn: 该规范没有强制要求 URI 字符与用于存储或传输这些字符的八位字节之间的映射的任何特定字符编码。

source: This specification does not place any limits on the nature of a resource, the reasons why an application might seek to refer to a resource, or the kinds of systems that might use URIs for the sake of identifying resources.
zh_cn: 此规范不对资源的性质，应用程序可能寻求引用资源的原因或可能使用 URI 以识别资源的系统类型进行任何限制。

source: This specification does not require that a URI persists in identifying the same resource over time, though that is a common goal of all URI schemes.
zh_cn: 尽管这是所有 URI 方案的共同目标，但此规范并不要求 URI 在一段时间内持续标识相同的资源。

source: This specification includes the key size of this algorithm, whether it is a block, stream, or AEAD cipher, the block size of the cipher (if appropriate), and the lengths of explicit and implicit initialization vectors (or nonces).
zh_cn: 该规范包括该算法的密钥大小，是否是块，流还是 AEAD 密码，密码的块大小(如果适用)，以及显式和隐式初始化 vector (或随机数)的长度。

source: This specification includes the size of the value returned by the MAC algorithm.
zh_cn: 该规范包括 MAC 算法返回的值的大小。

source: This specification must include all information the algorithm requires to do compression.
zh_cn: 此规范必须包括算法进行压缩所需的所有信息。

source: This specification now defines the Upgrade Token Registry, previously defined in Section 7.2 of [RFC2817].
zh_cn: 此规范现在定义了先前在 [RFC2817] 的第 7.2 节中定义的升级标记注册。

source: This specification of URI syntax and semantics is derived from concepts introduced by the World Wide Web global information initiative, whose use of such objects dates from 1990 and is described in "Universal Resource Identifiers in WWW" [RFC1630].
zh_cn: URI 语法和语义的这种规范源自万维网全球信息计划引入的概念，其对这些对象的使用可追溯到 1990 年并且在“WWW 中的统一资源标识符”[RFC1630] 中描述。

source: This specification of URI syntax and semantics is derived from concepts introduced by the World Wide Web global information initiative, whose use of these identifiers dates from 1990 and is described in "Universal Resource Identifiers in WWW" [RFC1630].
zh_cn: URI 语法和语义的这种规范源自万维网全球信息计划引入的概念，其使用这些标识符可以追溯到 1990 年并且在“WWW 中的统一资源标识符”[RFC1630] 中描述。

source: This specification only defines the protocol name "HTTP" for use by the family of Hypertext Transfer Protocols, as defined by the HTTP version rules of Section 2.6 and future updates to this specification.
zh_cn: 此规范仅定义协议名称“HTTP”供超文本传输​​协议族使用，如第 2.6 节的 HTTP 版本规则和本规范的未来更新所定义。

source: This specification places recipient-version requirements on some new features so that a conformant sender will only use compatible features until it has determined, through configuration or the receipt of a message, that the recipient supports HTTP/1.1.
zh_cn: 此规范对某些新功能设置了接收者版本要求，以便符合要求的仅使用兼容功能，直到通过配置或收到邮件确定接收者支持 HTTP/1.1。

source: This specification provides that hosts which "crash" without retaining any knowledge of the last sequence numbers transmitted on each active (i.e., not closed) connection shall delay emitting any TCP segments for at least the agreed Maximum Segment Lifetime (MSL) in the internet system of which the host is a part.
zh_cn: 该规范规定，在不保留每个活动(即非关闭)连接上发送的最后序列号的任何知识的情况下“崩溃”的主机应至少延迟发送任何 TCP 报文段，以便至少在主机是其中的一部分的互联网系统中达成协议的最大报文段寿命(MSL)。

source: This specification requires correct encoding of the EncryptedPreMasterSecret complete with length bytes.
zh_cn: 此规范要求使用长度字节对 EncryptedPreMasterSecret 进行正确编码。

source: This specification reserves the method name CONNECT for use with a proxy that can dynamically switch to being a tunnel (e.g. SSL tunneling [44]).
zh_cn: 此规范保留方法名称 CONNECT 以与可动态切换为隧道的代理一起使用(例如，SSL 隧道 [44])。

source: This specification targets conformance criteria according to the role of a participant in HTTP communication.
zh_cn: 该规范根据 HTTP 通信中参与者的角色来确定一致性标准。

source: This specification uses a number of terms to refer to the roles played by participants in, and objects of, the HTTP communication.
zh_cn: 本规范使用许多术语来指代 HTTP 通信中的参与者和对象所扮演的角色。

source: This specification uses the Augmented Backus-Naur Form (ABNF) notation of [RFC2234], including the following core ABNF syntax rules defined by that specification: ALPHA (letters), CR (carriage return),
zh_cn: 本规范使用 [RFC2234] 的 Augmented Backus-Naur Form(ABNF)表示法，包括该规范定义的以下核心 ABNF 语法规则：ALPHA(字母)，CR(回车)，

source: This specification uses the Augmented Backus-Naur Form (ABNF) notation of [RFC5234] with a list extension, defined in Section 7 of [RFC7230], that allows for compact definition of comma-separated lists using a '#' operator (similar to how the '*' operator indicates repetition).
zh_cn: 本规范使用 [RFC5234] 的 Augmented Backus-Naur Form(ABNF)符号和 [RFC7230] 第 7 节中定义的列表扩展，允许使用 '#' 操作符对逗号分隔列表进行紧凑定义(类似于 '*' 操作符如何表示重复)。

source: This specification uses the Augmented Backus-Naur Form (ABNF) notation of [RFC5234] with a list extension, defined in Section 7, that allows for compact definition of comma-separated lists using a '#' operator (similar to how the '*' operator indicates repetition).
zh_cn: 本规范使用 [RFC5234] 的 Augmented Backus-Naur Form(ABNF)符号和第 7 节中定义的列表扩展，允许使用 '#' 操作符紧凑定义逗号分隔列表(类似于 '*' 操作符表示重复)。

source: This specification uses the terms "character" and "coded character set" in accordance with the definitions provided in [BCP19], and "character encoding" in place of what [BCP19] refers to as a "charset".
zh_cn: 本说明书根据 [BCP19] 中提供的定义使用术语“字符”和“编码字符集”，并使用“字符编码”代替 [BCP19] 所称的“字符集”。

source: This specification uses the terms "character", "character encoding scheme", "charset", and "protocol element" as they are defined in [RFC6365].
zh_cn: 本规范使用术语“character”，“character encoding scheme”，“charset”和“protocol element”，因为它们在 [RFC6365] 中定义。

source: This specification uses three rules to denote the use of linear whitespace: OWS (optional whitespace), RWS (required whitespace), and BWS ("bad" whitespace).
zh_cn: 本规范使用三个规则来表示线性空白的使用：OWS(可选空白)，RWS(需要空白)和 BWS(“坏”空白)。

source: This structure conveys the client's Diffie-Hellman public value (Yc) if it was not already included in the client's certificate.
zh_cn: 这种结构传达客户端的 Diffie-Hellman 公开值(Yc)，如果它尚未包含在客户端的证书中。

source: This structure is a variant of the ClientKeyExchange message and is not a message in itself.
zh_cn: 此结构是 ClientKeyExchange 消息的变体，并且本身不是消息。

source: This structure is a variant of the client key exchange message, and not a message in itself.
zh_cn: 这种结构是客户端密钥交换消息的变体，而不是目的本身的消息。

source: This structure is generated by the server and MUST be generated independently of the ClientHello.random.
zh_cn: 该结构由服务器生成，并且必须独立于 ClientHello.random 生成。

source: This structure is generated by the server and MUST be independently generated from the ClientHello.random.
zh_cn: 此结构由服务器生成，并且必须独立于 ClientHello.random 生成。

source: This structure is intended to prevent an attack on previous versions of TLS in which the ServerKeyExchange format meant that attackers could obtain a signature of a message with a chosen 32-byte prefix (ClientHello.random).
zh_cn: 此结构旨在防止对先前版本的 TLS 的攻击，其中 ServerKeyExchange 格式意味着攻击者可以获得具有所选 32 字节前缀(ClientHello.random)的消息的签名。

source: This style of chaining methods is called a **fluent API** which resembles the **builder pattern**.
zh_cn: 这种链式方法称为 **fluent API (流式 API)**，类似于 **builder pattern (建造者模式)**。

source: This sub-protocol of TLS is used by the client and server when first communicating with each other.
zh_cn: 当首次相互通信时，客户端和服务器使用该 TLS 子协议。

source: This syntax does not support IPv6 scoped addressing zone identifiers.
zh_cn: 此语法不支持 IPv6 作用域寻址区域标识符。

source: This tree can help you find the ReactiveX Observable operator you’re looking for.
zh_cn: 此树可以帮助你找到你正在寻找的 ReactiveX Observable 操作符。

source: This type is subsequently defined to be an ASN.1 type, and the complete encoding is then identical to that of a value of the assigned type (including the identifier octets).
zh_cn: 随后将此类型定义为 ASN.1 类型，然后完整编码与指定类型的值(包括标识符八位字节)相同。

source: This unsigned arithmetic preserves the relationship of sequence numbers as they cycle from 2**32 - 1 to 0 again.
zh_cn: 这个无符号算术保留了序列号的关系，因为它们再次从 2**32 - 1 循环到 0。

source: This value MUST be in the same group as the KeyShareEntry value offered by the client that the server has selected for the negotiated key exchange.
zh_cn: 该值必须与服务器为协商密钥交换选择的客户端提供的 KeyShareEntry 值位于同一组中。

source: This value is computed by hashing the concatenation of each included handshake message, including the handshake message header carrying the handshake message type and length fields, but not including record layer headers.
zh_cn: 该值是通过散列每个包含的握手消息的串联来计算的，包括携带握手消息类型和长度字段的握手消息首部，但不包括记录层首部。

source: This value is transparent and is treated as an independent block to be dealt with by the higher-level protocol specified by the type field.
zh_cn: 此值是透明的，并被视为一个独立的块，由类型字段指定的更高级别协议处理。

source: This value need not be random but SHOULD be unpredictable to avoid implementations fixating on a specific value (also known as ossification).
zh_cn: 这个值不必是随机的，但应该是不可预测的，以避免实现固定在特定值(也称为骨化)。

source: This variant allows cleaning up the values themselves (e.g., releasing associated resources).
zh_cn: 该变体允许清除值本身(例如，释放相关资源)。

source: This vector MAY be empty if the client is requesting a HelloRetryRequest.
zh_cn: 如果客户端请求 HelloRetryRequest，则此 vector 可以为空。

source: This vector MUST contain, and all implementations MUST support, CompressionMethod.null.
zh_cn: 该 vector 必须包含，并且所有实现必须支持，CompressionMethod.null。

source: This version value is historical, deriving from the use of 0x0301 for TLS 1.0 and 0x0300 for SSL 3.0.
zh_cn: 此版本值是历史版本，源自对 TLS 1.0 使用 0x0301 和对 SSL 3.0 使用 0x0300。

source: This was changed to prevent the attacks described in [CBCATT].
zh_cn: 这被改变以防止 [CBCATT] 中描述的攻击。

source: This was practically unnecessary and the Reactive-Streams specification states that when a terminal event arrives at a `Subscriber`, the upstream `Subscription` should be considered cancelled and thus calling `cancel()` is a no-op.
zh_cn: 这实际上是不必要的，Reactive-Streams 规范声明当终端事件到达 `Subscriber` 时，上游的 `Subscription` 应被视为取消，因此调用 `cancel()` 是无操作。

source: This wiki page attempts to summarize what has changed and describes how to rewrite 1.x code into 2.x code.
zh_cn: 此 Wiki 页面试图总结已更改的内容，并描述如何将 1.x 代码重写为 2.x 代码。

source: This will allow downstream recipients to measure transfer progress, know when a received message is complete, and potentially reuse the connection for additional requests.
zh_cn: 这将允许下游接收者测量传输进度，知道收到的消息何时完成，并可能重用连接以获取其他请求。

source: This will also accomplish two sub-goals: preventing the need to create a new protocol (and risking the introduction of possible new weaknesses) and avoiding the need to implement an entire new security library.
zh_cn: 这也将实现两个子目标：防止创建新协议的需要(并冒着引入可能的新缺点的风险)并避免实现整个新安全库的需要。

source: This will consist of the scheduled key for that connection.
zh_cn: 这将包含该连接的计划密钥。

source: This will print:
zh_cn: 这将打印：

source: This, too, has a Scheduler-specific version:
zh_cn: 这也有一个 Scheduler 特定版本：

source: Those APIs feature some form of `addListener`/`removeListener` calls that one can utilize:
zh_cn: 这些 API 具有某种形式的 `addListener`/`removeListener` 调用，可以使用：

source: Those Observables can then (if they have no other interested observers) choose to stop generating new items to emit.
zh_cn: 那些 Observable 可以(如果他们没有其他感兴趣的观察者)选择停止生成要发射的新项目。

source: Those return a "global" scheduler instance whereas `test()` returned always a new instance of the `TestScheduler`.
zh_cn: 那些返回“全局”调度器实例，而 `test()` 总是返回 `TestScheduler` 的新实例。

source: Those that have a particular default Scheduler include:
zh_cn: 具有特定默认调度器的包括：

source: Those that remain are all Authenticated Encryption with Associated Data (AEAD) algorithms.
zh_cn: 剩下的都是带有关联数据(AEAD)算法的经过身份验证的加密。

source: Those who are using Mockito and mocked `Observer` in 1.x has to mock the `Subscriber.onSubscribe` method to issue an initial request, otherwise, the sequence will hang or fail with hot sources:
zh_cn: 那些在 1.x 中使用 Mockito 并模拟 `Observer` 的人必须模拟 `Subscriber.onSubscribe` 方法来发出初始请求，否则，序列将因热源而挂起或失败：

source: Thus 2DIGIT is a 2-digit number, and 3ALPHA is a string of three alphabetic characters.
zh_cn: 因此，2DIGIT 是一个 2 位数字，3ALPHA 是由三个字母字符组成的字符串。

source: Thus, "(elem (foo | bar) elem)" allows the token sequences "elem foo elem" and "elem bar elem".
zh_cn: 因此，“(elem (foo | bar) elem)”允许标记序列“elem foo elem”和“elem bar elem”。

source: Thus, HTTP/2.4 is a lower version than HTTP/2.13, which in turn is lower than HTTP/12.3.
zh_cn: 因此，HTTP/2.4 是比 HTTP/2.13 更低的版本，而 HTTP/2.13 又低于 HTTP/12.3。

source: Thus, a client and server will always be able to agree on a compression method.
zh_cn: 因此，客户端和服务器将始终能够就压缩方法达成一致。

source: Thus, a program could initiate several SENDs followed by a CLOSE, and then continue to RECEIVE until signaled that a RECEIVE failed because the other side has CLOSED.
zh_cn: 因此，一个程序可以启动几个 SEND，然后是 CLOSE，然后继续 RECEIVE，直到发出 RECEIVE 失败，因为另一方已经 CLOSED。

source: Thus, a resource can remain constant even when its content---the entities to which it currently corresponds---changes over time, provided that the conceptual mapping is not changed in the process.
zh_cn: 因此，即使在内容 - 它当前对应的实体 - 随时间变化的情况下，资源也可以保持不变，前提是概念映射在过程中没有改变。

source: Thus, a small window of time, during which the recipient must buffer the data, MAY exist.
zh_cn: 因此，可能存在一个小的时间窗口，在该窗口期间接收者必须缓冲数据。

source: Thus, any connection terminated with a fatal alert MUST NOT be resumed.
zh_cn: 因此，任何以致命警报终止的连接都不得恢复。

source: Thus, characters in the reserved set are protected from normalization and are therefore safe to be used by scheme-specific and producer-specific algorithms for delimiting data subcomponents within a URI.
zh_cn: 因此，保护​​集中的字符被保护免于标准化，因此安全地被特定于方案和生成器的算法用于界定 URI 内的数据子组件。

source: Thus, in the example below, "orange" and "banana" both contain V2.
zh_cn: 因此，在下面的例子中，“orange”和“banana”都包含 V2。

source: Thus, it is be possible for a TCP to maintain a zero receive window while transmitting data and receiving ACKs.
zh_cn: 因此，TCP 可以在发送数据和接收 ACK 时保持零接收窗口。

source: Thus, the ISN cycles approximately every 4.55 hours.
zh_cn: 因此，ISN 大约每 4.55 小时循环一次。

source: Thus, the RSA-encrypted PreMasterSecret in a ClientKeyExchange is preceded by two length bytes.
zh_cn: 因此，ClientKeyExchange 中的 RSA 加密的 PreMasterSecret 前面有两个长度字节。（译注：这里的意思是，根据 vector 的定义，需要用一个整数来表示实际长度，该值需要能够表示 2^16-1，因此需要 16 位即 2 字节）

source: Thus, the last 8 octets of the GenericBlockCipher before block encryption would be xx 06 06 06 06 06 06 06, where xx is the last octet of the MAC.
zh_cn: 因此，块加密之前的 GenericBlockCipher 的最后 8 个八位字节将是 xx 06 06 06 06 06 06 06，其中 xx 是 MAC 的最后一个八位字节。

source: Thus, the padding length modulo 8 must be equal to 6 in order to make the total length an even multiple of 8 bytes (the block length).
zh_cn: 因此，填充长度模 8 必须等于 6，以便使总长度为 8 字节(块长度)的偶数倍。

source: Timeout will cause a Single to abort with an error notification if it does not emit an item in a specified period of time after it is subscribed to.
zh_cn: 如果订阅后某个项目在指定的时间段内未发射该项目，则超时将导致 Single 中止并发射错误通知。

source: To allow for transition to absoluteURIs in all requests in future versions of HTTP, all HTTP/1.1 servers MUST accept the absoluteURI form in requests, even though HTTP/1.1 clients will only generate them in requests to proxies.
zh_cn: 为了允许在未来版本的 HTTP 中转换为所有请求中的 absoluteURI，所有 HTTP/1.1 服务器必须在请求中接受 absoluteURI 形式，即使 HTTP/1.1 客户端只在请求代理时生成它们。

source: To allow for transition to the absolute-form for all requests in some future version of HTTP, a server MUST accept the absolute-form in requests, even though HTTP/1.1 clients will only send them in requests to proxies.
zh_cn: 为了允许在某些未来版本的 HTTP 中转换为绝对形式的所有请求，服务器必须接受请求中的绝对形式，即使 HTTP/1.1 客户端只会将请求发送给代理。

source: To allow having RxJava 1.x and RxJava 2.x side-by-side, RxJava 2.x is under the maven coordinates `io.reactivex.rxjava2:rxjava:2.x.y` and classes are accessible below `io.reactivex`.
zh_cn: 为了允许 RxJava 1.x 和 RxJava 2.x 共存，RxJava 2.x 位于 maven 坐标 `io.reactivex.rxjava2:rxjava:2.x.y` 下，类可以在 `io.reactivex 下面访问。

source: To avoid confusion we must prevent segments from one incarnation of a connection from being used while the same sequence numbers may still be present in the network from an earlier incarnation.
zh_cn: 为了避免混淆，我们必须防止使用来自连接的一个化身的报文段，而相同的序列号可能仍然存在于早期化身的网络中。

source: To avoid overwhelming such steps, which usually would manifest itself as increased memory usage due to temporary buffering or the need for skipping/dropping data, a so-called backpressure is applied, which is a form of flow control where the steps can express how many items are they ready to process.
zh_cn: 为了避免 overwhelming 这些步骤，通常表现为由于临时缓冲或需要跳过/丢弃数据而增加内存，所以应用所谓的背压，这是流量控制的一种形式，其中步骤可以表达多少项目准备好了。

source: To avoid the TCP reset problem, servers typically close a connection in stages.
zh_cn: 为避免 TCP 重置问题，服务器通常会分阶段关闭连接。

source: To avoid the name clash, the 1.x `rx.Subscription` has been renamed into `io.reactivex.Disposable` (somewhat resembling .NET's own IDisposable).
zh_cn: 为避免名称冲突，1.x 的 `rx .Subscription` 已重命名为 `io .reactivex .Disposable`(有点类似于 .NET 自己的 IDisposable)。

source: To avoid this situation, make sure you call `request` **after** all initialization have been done in `onSubscribe`/`onStart`.
zh_cn: 为了避免这种情况，请确保在 `onSubscribe`/`onStart` 中完成所有初始化 **之后** 调用 `request`。

source: To be sure that a TCP does not create a segment that carries a sequence number which may be duplicated by an old segment remaining in the network, the TCP must keep quiet for a maximum segment lifetime (MSL) before assigning any sequence numbers upon starting up or recovering from a crash in which memory of sequence numbers in use was lost.
zh_cn: 为了确保 TCP 不会创建一个带有序列号的报文段，该报文段可能被网络中剩余的旧报文段复制，TCP 必须在启动时分配任何序列号之前保持安静，以获得最大报文段寿命(MSL)。或从崩溃中恢复，其中使用的序列号的内存丢失。
